/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec の機能拡張";
"06 06 02 82 06 01 0A 01"		= "Telesec メカニズム";

"06 07 02 82 06 01 0A 01 00"	= "Telesec 認証";
"06 08 02 82 06 01 0A 01 00 01"	= "パスワード認証";
"06 08 02 82 06 01 0A 01 00 02" = "保護されたパスワード認証";
"06 08 02 82 06 01 0A 01 00 03" = "一方向 X.509 認証";
"06 08 02 82 06 01 0A 01 00 04" = "双方向 X.509 認証";
"06 08 02 82 06 01 0A 01 00 05" = "三方向 X.509 認証";
"06 08 02 82 06 01 0A 01 00 06" = "一方向 ISO9798 認証";
"06 08 02 82 06 01 0A 01 00 07" = "双方向 ISO9798 認証";
"06 08 02 82 06 01 0A 01 00 08" = "Telekom 認証";

"06 07 02 82 06 01 0A 01 01"	= "Telesec 署名";
"06 08 02 82 06 01 0A 01 01 01"	= "RSA と ISO9697 を使用する MD4";
"06 08 02 82 06 01 0A 01 01 02"	= "RSA と Telesec 署名標準を使用する MD4";
"06 08 02 82 06 01 0A 01 01 03"	= "RSA と ISO9697 を使用する MD5";
"06 08 02 82 06 01 0A 01 01 04"	= "RSA と Telesec 署名標準を使用する MD5";
"06 08 02 82 06 01 0A 01 01 05"	= "RSA と Telekom 署名標準を使用する RIPEMD-160";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA 署名";

"06 07 02 82 06 01 0A 01 02"	= "Telesec 暗号化";
"06 08 02 82 06 01 0A 01 02 00"	= "なし";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "マゼンタ";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "一方向機能";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "ブロック暗号を使用するハッシュ";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "FEC 機能";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec モジュール";
"06 07 02 82 06 01 0A 02 00"	= "アルゴリズム";
"06 07 02 82 06 01 0A 02 01"	= "属性のタイプ";
"06 07 02 82 06 01 0A 02 02"	= "証明書のタイプ";
"06 07 02 82 06 01 0A 02 03"	= "メッセージのタイプ";
"06 07 02 82 06 01 0A 02 04"	= "PL プロトコル";
"06 07 02 82 06 01 0A 02 05"	= "SME と SME のコンポーネント";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "有効な定義";
"06 07 02 82 06 01 0A 02 08"	= "STE ファイル";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "電子注文";
"06 07 02 82 06 01 0A 02 0B"	= "Telesec TTP 非対称アプリケーション";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec TTP 基本アプリケーション";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP メッセージ";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec TTP タイムスタンプ・アプリケーション";

"06 06 02 82 06 01 0A 03"		= "オブジェクトクラス";
"06 07 02 82 06 01 0A 03 00"	= "Telesec のその他の名前";
"06 07 02 82 06 01 0A 03 01"	= "ディレクトリ";
"06 07 02 82 06 01 0A 03 02"	= "ディレクトリのタイプ";
"06 07 02 82 06 01 0A 03 03"	= "ディレクトリグループ";
"06 07 02 82 06 01 0A 03 04"	= "ディレクトリユーザ";
"06 07 02 82 06 01 0A 03 05"	= "対称鍵エントリー";

"06 06 02 82 06 01 0A 04"		= "パッケージ";
"06 06 02 82 06 01 0A 05"		= "パラメータ";
"06 06 02 82 06 01 0A 06"		= "名前のバインディング";
"06 06 02 82 06 01 0A 07"		= "属性";
"06 07 02 82 06 01 0A 07 00"	= "アプリケーショングループ識別子";
"06 07 02 82 06 01 0A 07 01"	= "証明書のタイプ";
"06 07 02 82 06 01 0A 07 02"	= "Telesec 証明書";
"06 07 02 82 06 01 0A 07 03"	= "証明書番号";
"06 07 02 82 06 01 0A 07 04"	= "証明書失効リスト";
"06 07 02 82 06 01 0A 07 05"	= "作成日";
"06 07 02 82 06 01 0A 07 06"	= "発行者";
"06 07 02 82 06 01 0A 07 07"	= "命名機関";
"06 07 02 82 06 01 0A 07 08"	= "公開鍵ディレクトリ";
"06 07 02 82 06 01 0A 07 09"	= "セキュリティドメイン";
"06 07 02 82 06 01 0A 07 0A"	= "サブジェクト";
"06 07 02 82 06 01 0A 07 0B"	= "失効の時間";
"06 07 02 82 06 01 0A 07 0C"	= "ユーザグループ参照";
"06 07 02 82 06 01 0A 07 0D"	= "有効性";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "セキュリティメッセージ環境";
"06 07 02 82 06 01 0A 07 10"	= "匿名の公開鍵ディレクトリ";
"06 07 02 82 06 01 0A 07 11"	= "Telesec 名";
"06 07 02 82 06 01 0A 07 12"	= "名前の追加";
"06 07 02 82 06 01 0A 07 13"	= "Telesec 郵便番号";
"06 07 02 82 06 01 0A 07 14"	= "名前識別子";
"06 07 02 82 06 01 0A 07 15"	= "Telesec 証明書リスト";
"06 07 02 82 06 01 0A 07 16"	= "Teletrust 証明書リスト";
"06 07 02 82 06 01 0A 07 17"	= "X.509 証明書リスト";
"06 07 02 82 06 01 0A 07 18"	= "発行の時間";
"06 07 02 82 06 01 0A 07 19"	= "物理カード番号";
"06 07 02 82 06 01 0A 07 1A"	= "ファイルタイプ";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl ファイルはアーカイブ";
"06 07 02 82 06 01 0A 07 1C"	= "メールアドレス";
"06 07 02 82 06 01 0A 07 1D"	= "証明書テンプレートリスト";
"06 07 02 82 06 01 0A 07 1E"	= "ディレクトリ名";
"06 07 02 82 06 01 0A 07 1F"	= "ディレクトリタイプ名";
"06 07 02 82 06 01 0A 07 20"	= "ディレクトリグループ名";
"06 07 02 82 06 01 0A 07 21"	= "ディレクトリユーザ名";
"06 07 02 82 06 01 0A 07 22"	= "失効フラグ";
"06 07 02 82 06 01 0A 07 23"	= "対称鍵エントリー名";
"06 07 02 82 06 01 0A 07 24"	= "GL 番号";
"06 07 02 82 06 01 0A 07 25"	= "GO 番号";
"06 07 02 82 06 01 0A 07 26"	= "G 鍵データ";
"06 07 02 82 06 01 0A 07 27"	= "Z 鍵データ";
"06 07 02 82 06 01 0A 07 28"	= "KT 鍵データ";
"06 07 02 82 06 01 0A 07 2A"	= "KT 鍵番号";
"06 07 02 82 06 01 0A 07 33"	= "失効生成の時間";
"06 07 02 82 06 01 0A 07 34"	= "責任性テキスト";

"06 06 02 82 06 01 0A 08"		= "属性グループ";
"06 06 02 82 06 01 0A 09"		= "操作";
"06 06 02 82 06 01 0A 0A"		= "通知";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "セキュリティアプリケーション";

"06 06 02 82 06 01 0A 0C"		= "証明書と CRL の機能拡張定義";

"06 07 02 82 06 01 0A 0C 00"	= "証明書機能拡張の責任性制限機能拡張";
"06 07 02 82 06 01 0A 0C 01"	= "Telesec 証明書 ID の機能拡張";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec ポリシー識別子";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec ポリシー修飾子 ID";
"06 07 02 82 06 01 0A 0C 04"	= "Telesec CRL フィルタを適用した機能拡張";
"06 07 02 82 06 01 0A 0C 05"	= "Telesec CRL フィルタの機能拡張";
"06 07 02 82 06 01 0A 0C 06"	= "Telesec 命名機関の機能拡張";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ユーザ ID";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822 メールボックス";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "ドメインコンポーネント";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Australian Business Number";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "証明書オーストラリアポリシー識別子";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet パーソナル";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet ビジネス";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet リーガル";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet パイロット";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet イントラネット";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet ポリシー識別子";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "対称暗号化アルゴリズム";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "SEIS High-Assurance ポリシー識別子";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK ポリシー識別子";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT 個人識別子";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57 モジュール";
"06 07 2A 86 48 CE 38 01 01"	= "X9F1 証明書管理";
"06 06 2A 86 48 CE 38 02"		= "保持命令";
"06 07 2A 86 48 CE 38 02 01"	= "保持命令コード - なし";
"06 07 2A 86 48 CE 38 02 02"	= "呼び出し発行者";
"06 07 2A 86 48 CE 38 02 03"	= "拒否";
"06 07 2A 86 48 CE 38 02 04"	= "ピックアップトークン";
"06 06 2A 86 48 CE 38 03"		= "属性";
"06 06 2A 86 48 CE 38 03 01"	= "副署";
"06 06 2A 86 48 CE 38 03 02"	= "属性証明書";
"06 06 2A 86 48 CE 38 04"		= "アルゴリズム";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA 一致";
"06 07 2A 86 48 CE 38 04 03"	= "SHA-1 を使用する DSA ";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ANSI X9.62 フィールドのタイプ";
"06 07 2A 86 48 CE 3D 01 01"	= "プライムフィールド";
"06 07 2A 86 48 CE 3D 01 02"	= "特性 - 2 つのフィールド";
"06 09 2A 86 48 CE 3D 01 02 03"	= "特性 - 2 つの基盤";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Null ベース";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "3 項式ベース";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "5 項式ベース";
"06 06 2A 86 48 CE 3D 02"		= "公開鍵のタイプ";
"06 07 2A 86 48 CE 3D 02 01"	= "楕円曲線公開鍵";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ANSI X9.42 フィールドのタイプ";
"06 07 2A 86 48 CE 3E 01 01"	= "ガロア・フィールド・プライム";
"06 06 2A 86 48 CE 3E 02"		= "番号のタイプ";
"06 07 2A 86 48 CE 3E 02 01"	= "Diffie-Hellman 公開鍵";
"06 06 2A 86 48 CE 3E 03"		= "方式";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman Static";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman Ephemeral";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman ハイブリッド 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman ハイブリッド 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Entrust バージョン情報";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "MD5 と CAST5-CBC を使用する PBE";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "パスワードベース MAC";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Entrust ユーザ";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Entrust CA 情報";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "属性証明書";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA 暗号化";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "RSA-MD2";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "RSA-MD4";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "RSA-MD5";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "RSA-SHA1";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP 暗号化（SET）";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP 暗号化";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP ラベル指定";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "RSA-PSS 署名方式";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "RSA-SHA256";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "RSA-SHA384";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "RSA-SHA512";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "RSA-SHA224";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE RSA 暗号化";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Diffie-Hellman 鍵共有";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "MD2 と DES-CBC を使用する PBE";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "MD5 と DES-CBC を使用する PBE";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "MD2 と RC2-CBC を使用する PBE";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "MD5 と RC2-CBC を使用する PBE";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "MD5 と XOR を使用する PBE";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "SHA と DES-CBC を使用する PBE";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "データ";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "署名データ";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "エンベロープデータ";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "署名データとエンベロープデータ";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "ダイジェストデータ";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "暗号化データ";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "属性付きデータ";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "暗号化秘密鍵情報";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "メールアドレス";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "非構造化名";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "コンテンツのタイプ";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "メッセージダイジェスト";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "署名時間";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "副署";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "チャレンジパスワード";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "非構造化アドレス";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "拡張証明書の属性";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "発行者とシリアル番号";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "パスワードチェック";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "公開鍵";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "署名の説明";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "機能拡張要求";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME 機能";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "署名データ提出";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "暗号を解除できません";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "受信通知要求";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "受信通知";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "コンテンツのヒント";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "メールリスト拡張履歴";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME モジュール";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "暗号メッセージ構文";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "拡張セキュリティサービス";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME オブジェクト識別子";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3 メッセージ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS 電子署名 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS 電子署名 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS 電子署名ポリシー 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS 電子署名ポリシー 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "S/MIME コンテンツのタイプ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "S/MIME 認証済み属性";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME アルゴリズム";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "S/MIME 証明書配布";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "LDAP 証明書配布";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME 署名ポリシー修飾子";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME 署名タイプ識別子";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "発信者署名";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "ドメイン署名";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "追加属性署名";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "署名を確認";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME 機能";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "内部のバイナリを選択";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "フレンドリ名（PKCS-12 用）";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "ローカル鍵 ID（PKCS-12 用）";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "証明書のタイプ（PKCS-12 用）";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509 証明書（PKCS-12 用）";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "SDSI 証明書（PKCS-12 用）";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "CRL のタイプ（PKCS-12 用）";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL（PKCS-12 用）";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 Personal Information Exchange Syntax";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12 パスワードベース暗号化 ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "SHA-1 と 128 ビット RC4 を使用する PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "SHA-1 と 40 ビット RC4 を使用する PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "SHA-1 と 3-Key Triple DES-CBC を使用する PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "SHA-1 と 2-Key Triple DES-CBC を使用する PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "SHA-1 と 128 ビット RC2-CBC を使用する PBE";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "SHA-1 と 40 ビット RC2-CBC を使用する PBE";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8 鍵の暗号化";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 バッグ ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12 鍵バッグ ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12 証明書と CRL バッグ ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 機密バッグ ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 安全なコンテンツ ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 暗号化された鍵バッグ ID";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12 証明書バッグ ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 X.509 証明書と CRL バッグ ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12 SDSI 証明書バッグ ID";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12 パスワードベース暗号化 ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "SHA-1 と 128 ビット RC4 を使用する PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "SHA-1 と 40 ビット RC4 を使用する PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "SHA-1 と Triple DES-CBC を使用する PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "SHA-1 と 128 ビット RC2-CBC を使用する PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "SHA-1 と 40 ビット RC2-CBC を使用する PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "SHA-1 と RC4 を使用する PKCS-12 PBE";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "SHA-1 と RC2-CBC を使用する PKCS-12 PBE";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 エンベロープ ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "128 ビット RC4 を使用する PKCS-12 RSA 暗号化";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "40 ビット RC4 を使用する PKCS-12 RSA 暗号化";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Triple DES を使用する PKCS-12 RSA 暗号化";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12 署名 ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "SHA-1 ダイジェストを使用する PKCS-12 RSA 署名";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 バージョン 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 バッグ ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12 鍵バッグ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 暗号化された鍵バッグ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12 証明書バッグ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12 CRL バッグ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 機密バッグ";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 安全なコンテンツのバッグ";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15 モジュール";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15 の属性";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15 コンテンツのタイプ";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15 コンテンツ";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI ダイジェストアルゴリズム";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "SHA-1 を使用する HMAC";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI 暗号化アルゴリズム";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "MAC を使用する RC4";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC パッド";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identrus 不明ポリシー識別子";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT ユーザ対ユーザ Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server オブジェクトクラス";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "サイトアドレスの設定";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "クラス方式";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "属性方式";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "メールボックスエージェント";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "メールボックス";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "コンテナ";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "メール受信者";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "配布メカニズム";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoft ファイルフォーマット";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "SPC 間接データコンテンツ";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC 中間証明機関情報";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "SPC 明細書のタイプ";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC 著作情報";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC 証明書の機能拡張";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC PE イメージデータ";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC リンク（タイプ 1）";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "個人コード署名";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "業務コード署名";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC リンク（タイプ 2）";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "SPC 最小基準";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "SPC 財務基準";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC リンク（タイプ 3）";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "NTLM セキュリティ・サポート・プロバイダ";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "タイムスタンプ副署";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "証明書信頼リスト";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "ソートされた CTL の機能拡張";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "次のアップデートの場所";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "拡張鍵用途";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "証明書信頼リスト署名";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "タイムスタンプ署名";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Server Gated Crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "シリアル化された暗号化";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "暗号化されたファイルシステム";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "暗号化されたファイルシステムの回復";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Windows ハードウェア互換";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5 署名";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Windows ハードウェア OEM 署名";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "埋め込まれた NT 署名";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "信頼されたルートリスト署名";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "限定従属";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "鍵回復";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "書類署名";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "属性オブジェクト識別子";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Yes/No 信頼属性";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft 音楽 DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM 個別化";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft ライセンス";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft ライセンスサーバ";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10 オブジェクト識別子";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "更新証明書";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "登録名／値ペア";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "登録 CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "OS バージョン";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12 の属性";
"06 09 2B 06 01 04 01 82 37 11 01"			= "ローカルコンピュータの鍵セット";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft 登録インフラストラクチャ";
"06 09 2B 06 01 04 01 82 37 14 01"			= "自動登録 CTL の使用法";
"06 09 2B 06 01 04 01 82 37 14 02"			= "登録証明書のタイプ";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "登録エージェント";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "スマートカードログオン";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "NT プリンシパル名";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft Certificate Server インフラストラクチャ";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA Renewal のバージョン";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "CAPICOM のバージョン";
"06 09 2B 06 01 04 01 82 37 58 02"			= "CAPICOM の属性";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "書類の名前";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "書類の説明";
"06 09 2B 06 01 04 01 82 37 58 03"			= "暗号化データ";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "暗号化コンテンツ";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT ポリシー識別子";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL ポリシー識別子";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA ポリシー識別子";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "SHA-1 を使用する ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "RIPEMD-160 を使用する ElGamal";
"06 09 2B 06 01 04 01 97 55 03 01"			= "cryptlib の属性";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "cryptlib 存在チェック";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP 応答 RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP 応答 RTCS 拡張";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "CRL 拡張理由";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "鍵機能";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI ブート";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib のコンテンツ";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "cryptlib 構成データ";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "cryptlib ユーザインデックス";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "cryptlib ユーザ情報";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY ポリシー識別子";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "時間署名システム";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "時間署名システム 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "時間署名システム 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "時間署名システム 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "二次運用";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Physician 識別子";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos 認証データ";
"06 07 2B 06 01 05 02 03 02"        = "Kerberos Diffie-Hellman 鍵データ";
"06 07 2B 06 01 05 02 03 03"        = "Kerberos 応答鍵データ";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos クライアント認証";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos KDC（Key Distribution Center）";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "SPKM（Simple Public Key Mechanism）";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "公開鍵のインフラストラクチャ";

"06 07 2B 06 01 05 05 07 01"		= "PKIX プライベート証明書の機能拡張";
"06 08 2B 06 01 05 05 07 01 01"		= "認証局情報アクセス";
"06 08 2B 06 01 05 05 07 01 02"		= "バイオメトリクス情報";
"06 08 2B 06 01 05 05 07 01 03"		= "条件付き証明書明細書";
"06 08 2B 06 01 05 05 07 01 04"		= "属性証明書監査 ID";
"06 08 2B 06 01 05 05 07 01 05"		= "属性証明書ターゲット";
"06 08 2B 06 01 05 05 07 01 06"		= "属性認証局制御";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP IP アドレスブロック";
"06 08 2B 06 01 05 05 07 01 08"		= "SBGP 自律システム識別子";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP ルーター識別子";
"06 08 2B 06 01 05 05 07 01 0A"		= "属性証明書プロキシ";
"06 08 2B 06 01 05 05 07 01 0B"		= "サブジェクト情報アクセス";
"06 08 2B 06 01 05 05 07 01 0C"		= "ロゴタイプ";

"06 07 2B 06 01 05 05 07 02"		= "ポリシー修飾子のタイプ";
"06 08 2B 06 01 05 05 07 02 01"		= "証明書運用明細書";
"06 08 2B 06 01 05 05 07 02 02"		= "ユーザ通知";
"06 08 2B 06 01 05 05 07 02 03"		= "テキスト通知";

"06 07 2B 06 01 05 05 07 03"		= "鍵の目的";
"06 08 2B 06 01 05 05 07 03 01"		= "サーバ認証";
"06 08 2B 06 01 05 05 07 03 02"		= "クライアント認証";
"06 08 2B 06 01 05 05 07 03 03"		= "コード署名";
"06 08 2B 06 01 05 05 07 03 04"		= "メール保護";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC 終了システム";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC トンネル";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC ユーザ";
"06 08 2B 06 01 05 05 07 03 08"		= "タイムスタンプ";
"06 08 2B 06 01 05 05 07 03 09"		= "OCSP 署名";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP AA サーバ認証";

"06 07 2B 06 01 05 05 07 04"		= "CMP 情報のタイプ";
"06 08 2B 06 01 05 05 07 04 01"		= "CA プロトコル暗号化証明書";
"06 08 2B 06 01 05 05 07 04 02"		= "署名鍵ペアのタイプ";
"06 08 2B 06 01 05 05 07 04 03"		= "暗号化鍵ペアのタイプ";
"06 08 2B 06 01 05 05 07 04 04"		= "優先する対称アルゴリズム";
"06 08 2B 06 01 05 05 07 04 05"		= "CA 鍵アップデート情報";
"06 08 2B 06 01 05 05 07 04 06"		= "最新の CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "サポートされていない OID";
"06 08 2B 06 01 05 05 07 04 08"		= "照会要求";
"06 08 2B 06 01 05 05 07 04 09"		= "照会応答";
"06 08 2B 06 01 05 05 07 04 0A"		= "鍵ペアパラメータ要求";
"06 08 2B 06 01 05 05 07 04 0B"		= "鍵ペアパラメータ応答";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "CRMF 登録";
"06 08 2B 06 01 05 05 07 05 01"		= "登録制御";
"06 09 2B 06 01 05 05 07 05 01 01"	= "登録トークン";
"06 09 2B 06 01 05 05 07 05 01 02"	= "認証子";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI 公開情報";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI アーカイブオプション";
"06 09 2B 06 01 05 05 07 05 01 05"	= "古い証明書 ID";
"06 09 2B 06 01 05 05 07 05 01 06"	= "プロトコル暗号化鍵";
"06 09 2B 06 01 05 05 07 05 01 07"	= "代替証明書テンプレート";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS テンプレート";

"06 08 2B 06 01 05 05 07 05 02"		= "CRMF 登録情報";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8 ペア";
"06 09 2B 06 01 05 05 07 05 02 02"	= "証明書要求";

"06 07 2B 06 01 05 05 07 06"		= "アルゴリズム";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "署名なし";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "CMC 制御";

"06 07 2B 06 01 05 05 07 08"		= "その他の名前";
"06 08 2B 06 01 05 05 07 08 01"		= "個人データ";
"06 08 2B 06 01 05 05 07 08 02"		= "ユーザグループ";

"06 07 2B 06 01 05 05 07 09"		= "個人データ";
"06 08 2B 06 01 05 05 07 09 01"		= "生年月日";
"06 08 2B 06 01 05 05 07 09 02"		= "出生地";
"06 08 2B 06 01 05 05 07 09 03"		= "ペンネーム";
"06 08 2B 06 01 05 05 07 09 04"		= "性別";
"06 08 2B 06 01 05 05 07 09 05"		= "国籍";
"06 08 2B 06 01 05 05 07 09 06"		= "居住国";

"06 07 2B 06 01 05 05 07 0A"		= "属性証明書";
"06 08 2B 06 01 05 05 07 0A 01"		= "認証情報";
"06 08 2B 06 01 05 05 07 0A 02"		= "アクセス ID";
"06 08 2B 06 01 05 05 07 0A 03"		= "課金 ID";
"06 08 2B 06 01 05 05 07 0A 04"		= "グループ";
"06 08 2B 06 01 05 05 07 0A 05"		= "役割";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "オンライン証明書状況プロトコル";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP 基本応答";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP Nonce の機能拡張";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP CRL 参照";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP 応答";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP による失効チェック";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP 記録停止";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP サービスロケータ";

"06 08 2B 06 01 05 05 07 30 02"		= "CA 発行者";
"06 08 2B 06 01 05 05 07 30 03"		= "タイムスタンプ";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE 中間";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "DEC 暗号化アルゴリズム";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "DEC ハッシュアルゴリズム";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "DEC 署名アルゴリズム";
"06 07 2B 0C 02 87 73 07 03 01"		= "RSA を使用する DEC MD2";
"06 07 2B 0C 02 87 73 07 03 02"		= "RSA を使用する DEC MD4";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "RSA を使用する MD4";
"06 05 2B 0E 03 02 03"				= "RSA を使用する MD5";
"06 05 2B 0E 03 02 04"				= "RSA-MD4";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "RSA を使用する SqMod-N";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA 署名";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "SHA を使用する DSA";
"06 05 2B 0E 03 02 0E"				= "RSA 署名を使用する MDC2";
"06 05 2B 0E 03 02 0F"				= "RSA 署名を使用する SHA";
"06 05 2B 0E 03 02 10"				= "共通係数を使用する Diffie-Hellman";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Common";
"06 05 2B 0E 03 02 15"				= "SHA を使用する DSA Common";
"06 05 2B 0E 03 02 16"				= "RSA 鍵トランスポート";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "RSA 署名を使用する MD2";
"06 05 2B 0E 03 02 19"				= "RSA 署名を使用する MD5";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "SHA-1 を使用する DSA ";
"06 05 2B 0E 03 02 1C"				= "Common SHA-1 を使用する DSA ";
"06 05 2B 0E 03 02 1D"				= "RSA-SHA1";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "RSA を使用する MD2";
"06 06 2B 0E 07 02 03 02"			= "ElGamal を使用する MD2";

/* Teletrust */

"06 03 2B 24 01"					= "書類";
"06 04 2B 24 01 01"					= "最終バージョン";
"06 04 2B 24 01 02"					= "下書き";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "アルゴリズム";
"06 04 2B 24 03 01"					= "暗号化アルゴリズム";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB パッド";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO パッド";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC パッド";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO パッド";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB パッド";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO パッド";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC パッド";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO パッド";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB パッド";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO パッド";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC パッド";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO パッド";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA 暗号化";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB パッド";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC パッド";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM パッド";

"06 04 2B 24 03 02"					= "ハッシュアルゴリズム";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 単長";
"06 05 2B 24 03 02 05"				= "MDC2 倍長";
"06 04 2B 24 03 03"					= "署名アルゴリズム";
"06 05 2B 24 03 03 01"				= "RSA 署名";

"06 06 2B 24 03 03 01 01"			= "SHA-1 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 84 00 02"	= "SHA-1 512/L2 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 85 00 02"	= "SHA-1 640/L2 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 86 00 02"	= "SHA-1 768/L2 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 87 00 02"	= "SHA-1 896/L2 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 88 00 02"	= "SHA-1 1024/L2 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 84 00 03"	= "SHA-1 512/L3 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 85 00 03"	= "SHA-1 640/L3 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 86 00 03"	= "SHA-1 768/L3 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 87 00 03"	= "SHA-1 896/L3 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 88 00 03"	= "SHA-1 1024/L3 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 84 00 05"	= "SHA-1 512/L5 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 85 00 05"	= "SHA-1 640/L5 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 86 00 05"	= "SHA-1 768/L5 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 87 00 05"	= "SHA-1 896/L5 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 88 00 05"	= "SHA-1 1024/L5 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 84 00 09"	= "SHA-1 512/L9 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 85 00 09"	= "SHA-1 640/L9 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 86 00 09"	= "SHA-1 768/L9 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 87 00 09"	= "SHA-1 896/L9 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 88 00 09"	= "SHA-1 1024/L9 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 84 00 11"	= "SHA-1 512/L11 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 85 00 11"	= "SHA-1 640/L11 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 86 00 11"	= "SHA-1 768/L11 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 87 00 11"	= "SHA-1 896/L11 を使用する RSA 署名";
"06 09 2B 24 03 03 01 01 88 00 11"	= "SHA-1 1024/L11 を使用する RSA 署名";

"06 06 2B 24 03 03 01 02"			= "RIPEMD-160 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 84 00 02"	= "RIPEMD-160 512/L2 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 85 00 02"	= "RIPEMD-160 640/L2 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 86 00 02"	= "RIPEMD-160 768/L2 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 87 00 02"	= "RIPEMD-160 896/L2 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 88 00 02"	= "RIPEMD-160 1024/L2 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 84 00 03"	= "RIPEMD-160 512/L3 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 85 00 03"	= "RIPEMD-160 640/L3 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 86 00 03"	= "RIPEMD-160 768/L3 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 87 00 03"	= "RIPEMD-160 896/L3 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 88 00 03"	= "RIPEMD-160 1024/L3 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 84 00 05"	= "RIPEMD-160 512/L5 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 85 00 05"	= "RIPEMD-160 640/L5 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 86 00 05"	= "RIPEMD-160 768/L5 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 87 00 05"	= "RIPEMD-160 896/L5 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 88 00 05"	= "RIPEMD-160 1024/L5 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 84 00 09"	= "RIPEMD-160 512/L9 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 85 00 09"	= "RIPEMD-160 640/L9 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 86 00 09"	= "RIPEMD-160 768/L9 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 87 00 09"	= "RIPEMD-160 896/L9 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 88 00 09"	= "RIPEMD-160 1024/L9 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 84 00 11"	= "RIPEMD-160 512/L11 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 85 00 11"	= "RIPEMD-160 640/L11 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 86 00 11"	= "RIPEMD-160 768/L11 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 87 00 11"	= "RIPEMD-160 896/L11 を使用する RSA 署名";
"06 09 2B 24 03 03 01 02 88 00 11"	= "RIPEMD-160 1024/L11 を使用する RSA 署名";

"06 06 2B 24 03 03 01 03"			= "RIPEMD-128 を使用する RSA 署名";
"06 06 2B 24 03 03 01 04"			= "RIPEMD-256 を使用する RSA 署名";

"06 05 2B 24 03 03 02"				= "ECSIE 署名";
"06 06 2B 24 03 03 02 01"			= "SHA-1 を使用する ECSIE 署名";
"06 06 2B 24 03 03 02 02"			= "RIPEMD-160 を使用する ECSIE 署名";
"06 06 2B 24 03 03 02 03"			= "MD2 を使用する ECSIE 署名";
"06 06 2B 24 03 03 02 04"			= "MD5 を使用する ECSIE 署名";

"06 04 2B 24 03 04"					= "署名の方式";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "RED を使用する ISO9796-2";
"06 06 2B 24 03 04 02 02"			= "RSA を使用する ISO9796-2";
"06 06 2B 24 03 04 02 03"			= "RND を使用する ISO9796-2";

"06 03 2B 24 04"					= "属性";
"06 03 2B 24 05"					= "ポリシー";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "製造元固有の API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "機能固有の API";
"06 03 2B 24 07"					= "鍵管理";
"06 04 2B 24 07 01"					= "鍵の承諾";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "鍵の転送";
"06 05 2B 24 07 02 01"				= "RSA-ISO9796-2";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform ポリシー識別子";
"06 05 2B 24 08 02 01"				= "ディレクトリサービス";

"06 05 2B 24 08 03 01"				= "証明書生成の日付";
"06 05 2B 24 08 03 02"				= "入手";
"06 05 2B 24 08 03 03"				= "許可";
"06 05 2B 24 08 03 04"				= "通貨制限";
"06 05 2B 24 08 03 05"				= "大多数の宣言";
"06 05 2B 24 08 03 06"				= "IC カードシリアル番号";
"06 05 2B 24 08 03 07"				= "公開鍵参照";
"06 05 2B 24 08 03 08"				= "制限";
"06 05 2B 24 08 03 09"				= "許可されていれば取得";
"06 05 2B 24 08 03 0A"				= "要求された証明書";
"06 05 2B 24 08 03 0B"				= "命名機関";
"06 05 2B 24 08 03 0C"				= "以後のディレクトリ内の証明書";
"06 05 2B 24 08 03 0D"				= "証明書ハッシュ";

"06 05 2B 24 08 04 01"				= "個人データ";
"06 05 2B 24 08 04 08"				= "制限";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "SHA-1 を使用する RSA";
"06 07 2B 24 08 05 01 01 04"		= "RIPEMD-160 を使用する RSA";
"06 07 2B 24 08 05 01 02 01"		= "DSA 拡張";
"06 07 2B 24 08 05 01 02 02"		= "RIPEMD-160 を使用する DSA";

"06 05 2B 24 08 06 01"				= "証明書";
"06 05 2B 24 08 06 02"				= "証明書参照";
"06 05 2B 24 08 06 03"				= "属性証明書";
"06 05 2B 24 08 06 04"				= "属性参照";
"06 05 2B 24 08 06 05"				= "ファイル名";
"06 05 2B 24 08 06 06"				= "保管時間";
"06 05 2B 24 08 06 07"				= "ファイルサイズ";
"06 05 2B 24 08 06 08"				= "場所";
"06 05 2B 24 08 06 09"				= "署名番号";
"06 05 2B 24 08 06 0A"				= "自動生成";

"06 05 2B 24 08 07 01"				= "Teletrust プレゼンテーションのタイプ";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "二進（バイナリ）";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "テキスト";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Thawte 証明書の機能拡張";
"06 05 2B 65 01 04 01"				= "強力なエクストラネット";

/* X.520 */

"06 02 55 04"		= "X.520 属性のタイプ";
"06 03 55 04 00"	= "オブジェクトクラス";
"06 03 55 04 01"	= "エイリアスエントリー名";
"06 03 55 04 02"	= "知識情報";
"06 03 55 04 03"	= "コモンネーム";
"06 03 55 04 04"	= "姓";
"06 03 55 04 05"	= "シリアル番号";
"06 03 55 04 06"	= "国名";
"06 03 55 04 07"	= "地域名";
"06 04 55 04 07 01"	= "地域名（集団）";
"06 03 55 04 08"	= "州名または地方名";
"06 04 55 04 08 01"	= "州名または地方名（集団）";
"06 03 55 04 09"	= "以降の住所";
"06 04 55 04 09 01"	= "以降の住所（集団）";
"06 03 55 04 0A"	= "組織名";
"06 04 55 04 0A 01"	= "組織名（集団）";
"06 03 55 04 0B"	= "組織単位名";
"06 04 55 04 0B 01"	= "組織単位名（集団）";
"06 03 55 04 0C"	= "タイトル";
"06 03 55 04 0D"	= "説明";
"06 03 55 04 0E"	= "検索ガイド";
"06 03 55 04 0F"	= "業種";
"06 03 55 04 10"	= "郵便用アドレス";
"06 04 55 04 10 01"	= "郵便用アドレス（集団）";
"06 03 55 04 11"	= "郵便番号";
"06 04 55 04 11 01"	= "郵便番号（集団）";
"06 03 55 04 12"	= "私書箱";
"06 04 55 04 12 01"	= "私書箱（集団）";
"06 03 55 04 13"	= "集配局名";
"06 04 55 04 13 01"	= "集配局名（集団）";
"06 03 55 04 14"	= "電話番号";
"06 04 55 04 14 01"	= "電話番号（集団）";
"06 03 55 04 15"	= "テレックス番号";
"06 04 55 04 15 01"	= "テレックス番号（集団）";
"06 03 55 04 16"	= "テレックス端末 ID";
"06 04 55 04 16 01"	= "テレックス端末 ID（集団）";
"06 03 55 04 17"	= "ファクス番号";
"06 04 55 04 17 01"	= "ファクス番号（集団）";
"06 03 55 04 18"	= "X.121 アドレス";
"06 03 55 04 19"	= "国際 ISDN 番号";
"06 04 55 04 19 01"	= "国際 ISDN 番号（集団）";
"06 03 55 04 1A"	= "登録住所";
"06 03 55 04 1B"	= "宛先表示";
"06 03 55 04 1C"	= "優先する配布方法";
"06 03 55 04 1D"	= "表示用アドレス";
"06 03 55 04 1E"	= "対応しているアプリケーションコンテキスト";
"06 03 55 04 1F"	= "メンバー";
"06 03 55 04 20"	= "オーナー";
"06 03 55 04 21"	= "役割のメンバー";
"06 03 55 04 22"	= "関連項目";
"06 03 55 04 23"	= "ユーザパスワード";
"06 03 55 04 24"	= "ユーザ証明書";
"06 03 55 04 25"	= "CA 証明書";
"06 03 55 04 26"	= "証明書失効リスト（ARL）";
"06 03 55 04 27"	= "証明書失効リスト";
"06 03 55 04 28"	= "相互認証証明書ペア";
"06 03 55 04 29"	= "名前";
"06 03 55 04 2A"	= "名";
"06 03 55 04 2B"	= "イニシャル";
"06 03 55 04 2C"	= "生成修飾子";
"06 03 55 04 2D"	= "一意識別子";
"06 03 55 04 2E"	= "DN 修飾子";
"06 03 55 04 2F"	= "拡張検索ガイド";
"06 03 55 04 30"	= "プロトコル情報";
"06 03 55 04 31"	= "識別名";
"06 03 55 04 32"	= "一意のメンバー";
"06 03 55 04 33"	= "家の識別子";
"06 03 55 04 34"	= "対応するアルゴリズム";
"06 03 55 04 35"	= "差分失効リスト";
"06 03 55 04 36"	= "クリアランス";
"06 03 55 04 3A"	= "相互認証証明書ペア";

/* X.500 object classes */

"06 02 55 06"		= "X.520 オブジェクトクラス";
"06 03 55 06 00"	= "上";
"06 03 55 06 01"	= "エイリアス";
"06 03 55 06 02"	= "国";
"06 03 55 06 03"	= "地域";
"06 03 55 06 04"	= "組織";
"06 03 55 06 05"	= "組織単位";
"06 03 55 06 06"	= "個人";
"06 03 55 06 07"	= "組織のメンバー";
"06 03 55 06 08"	= "組織の役割";
"06 03 55 06 09"	= "名前のグループ";
"06 03 55 06 0A"	= "居住者";
"06 03 55 06 0B"	= "アプリケーション処理";
"06 03 55 06 0C"	= "アプリケーションエンティティ";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "デバイス";
"06 03 55 06 0F"	= "強力な認証ユーザ";
"06 03 55 06 10"	= "認証局";
"06 03 55 06 11"	= "一意名のグループ";
"06 03 55 06 15"	= "PKI ユーザ";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "X.500 アルゴリズム";
"06 03 55 08 01"	= "X.500 暗号化アルゴリズム";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "X.509 証明書の機能拡張";
"06 03 55 1D 01"	= "証明書鍵識別子 (古い)";
"06 03 55 1D 02"	= "主鍵の属性 (古い)";
"06 03 55 1D 03"	= "証明書ポリシー (古い)";
"06 03 55 1D 04"	= "鍵用途制限 (古い)";
"06 03 55 1D 05"	= "ポリシーマッピング (古い)";
"06 03 55 1D 06"	= "サブツリーの制約";
"06 03 55 1D 07"	= "サブジェクト代替名 (古い)";
"06 03 55 1D 08"	= "I発行者の代替名 (古い)";
"06 03 55 1D 09"	= "サブジェクトディレクトリ属性";
"06 03 55 1D 0A"	= "基本的な制約 (古い 2.5.29.10)";
"06 03 55 1D 0B"	= "名前の制約 (古い)";
"06 03 55 1D 0C"	= "ポリシーの制約 (古い)";
"06 03 55 1D 0D"	= "基本的な制約 (古い 2.5.29.13)";
"06 03 55 1D 0E"	= "サブジェクト鍵識別子";
"06 03 55 1D 0F"	= "鍵用途";
"06 03 55 1D 10"	= "秘密鍵の使用期間";
"06 03 55 1D 11"	= "サブジェクト代替名";
"06 03 55 1D 12"	= "発行者の代替名";
"06 03 55 1D 13"	= "基本的な制約";
"06 03 55 1D 14"	= "証明書失効リスト（CRL）番号";
"06 03 55 1D 15"	= "CRL 理由コード";
"06 03 55 1D 16"	= "有効期限 (古い)";
"06 03 55 1D 17"	= "保持命令コード";
"06 03 55 1D 18"	= "無効日";
"06 03 55 1D 19"	= "CRL 配布ポイント (古い)";
"06 03 55 1D 1A"	= "発行側の配布ポイント (古い)";
"06 03 55 1D 1B"	= "差分 CRL 表示";
"06 03 55 1D 1C"	= "発行側の配布ポイント";
"06 03 55 1D 1D"	= "証明書発行者";
"06 03 55 1D 1E"	= "名前の制約";
"06 03 55 1D 1F"	= "CRL 配布ポイント";
"06 03 55 1D 20"	= "証明書ポリシー";
"06 04 55 1D 20 00"	= "任意のポリシー識別子";
"06 03 55 1D 21"	= "ポリシーマッピング";
"06 03 55 1D 22"	= "ポリシーの制約";
"06 03 55 1D 23"	= "証明書鍵識別子";
"06 03 55 1D 24"	= "ポリシーの制約";
"06 03 55 1D 25"	= "拡張鍵用途";
"06 04 55 1D 25 00"	= "任意の拡張鍵用途";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS 署名アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza 署名アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS 機密性アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza 機密性アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS 整合性アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza 整合性アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS トークン保護アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza トークン保護アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS 鍵管理アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza 鍵管理アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS 鍵管理および署名アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza 鍵管理および署名アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A 署名アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A 機密性アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A 整合性アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A トークン保護アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A 鍵管理アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A 鍵管理および署名アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 13"	= "Fortezza アップデート署名アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza 鍵管理およびアップデート署名アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 15"	= "Fortezza アップデート整合性アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 16"	= "鍵交換アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza Wrap80 アルゴリズム";
"06 09 60 86 48 01 65 02 01 01 18"	= "KEA（Key Encryption Algorithm）";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822 メッセージフォーマット";
"06 09 60 86 48 01 65 02 01 02 02"	= "空のコンテンツ";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP コンテンツのタイプ";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3 コンテンツのタイプ";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP コンテンツのタイプ";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP Rekey エージェントプロトコル";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1 コンテンツのタイプ";
"06 09 60 86 48 01 65 02 01 02 48"	= "転送された MSP メッセージの本文";
"06 09 60 86 48 01 65 02 01 02 49"	= "MSP から転送されたメッセージのパラメータ";
"06 09 60 86 48 01 65 02 01 02 50"	= "転送された CSP メッセージの本文";
"06 09 60 86 48 01 65 02 01 02 51"	= "CSP から転送されたメッセージのパラメータ";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS セキュリティポリシー";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "セキュリティポリシー";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "一般";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "デフォルトのセキュリティポリシー";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS 鍵管理証明書";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS ユーザ署名証明書";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS 鍵管理および署名証明書";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza 鍵管理証明書";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza 鍵管理および署名証明書";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza ユーザ署名証明書";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza CA 署名証明書";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS CA 署名証明書";
"06 09 60 86 48 01 65 02 01 05 0A"	= "補助ベクトル";
"06 09 60 86 48 01 65 02 01 05 0B"	= "受信通知ポリシー";
"06 09 60 86 48 01 65 02 01 05 0C"	= "メンバーシップ";
"06 09 60 86 48 01 65 02 01 05 0D"	= "管理者";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "メタ SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "メタ SDNS 署名 CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS 署名 CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "SDNS 証明書失効リスト（CRL）";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Fortezza 証明書失効リスト（CRL）";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "適用除外アドレスプロセッサ";
"06 09 60 86 48 01 65 02 01 05 30"	= "保護";
"06 09 60 86 48 01 65 02 01 05 31"	= "対応するアルゴリズム";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A 鍵管理証明書";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A 鍵管理および署名証明書";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A ユーザ署名証明書";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC 情報";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC CA 制約";
"06 09 60 86 48 01 65 02 01 05 37"	= "署名または鍵管理アクセス権";
"06 09 60 86 48 01 65 02 01 05 38"	= "共通アクセス権";
"06 09 60 86 48 01 65 02 01 05 39"	= "ラベル付き属性";
"06 09 60 86 48 01 65 02 01 05 3A"	= "ポリシー情報ファイル";
"06 09 60 86 48 01 65 02 01 05 3B"	= "セキュリティポリシー情報ファイル";
"06 09 60 86 48 01 65 02 01 05 3C"	= "CA クリアランス制約";

"06 09 60 86 48 01 65 02 01 07 01"		= "CSP の機能拡張";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI セキュリティカテゴリ";
"06 09 60 86 48 01 65 02 01 08 02"		= "標準セキュリティ・ラベル・アクセス権";

"06 09 60 86 48 01 65 02 01 0A 01"			= "署名アクセス権";
"06 09 60 86 48 01 65 02 01 0A 02"			= "鍵管理アクセス権";
"06 09 60 86 48 01 65 02 01 0A 03"			= "名前付きタグセット・アクセス権";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK デモ";
"06 09 60 86 48 01 65 02 01 0B 02"			= "米国国防省クラス 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium (試行版)";
"06 09 60 86 48 01 65 02 01 0B 04"			= "米国国防省クラス 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "米国国防省クラス 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "米国国防省クラス 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "米国国防省 PKI クラス 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "テスト・セキュリティ・ポリシー";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 タグセット 0";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 タグセット 1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 タグセット 2";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2 セキュリティカテゴリ";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 タグセット 0";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 タグセット 1";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 タグセット 2";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka セキュリティカテゴリ";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka タグセット名 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka タグセット名 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka タグセット名 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "テスト CRL エントリー";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "ラベル";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK ポリシー識別子";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "FBCA Rudimentary ポリシー識別子";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "FBCA Basic ポリシー識別子";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "FBCA Medium ポリシー識別子";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "FBCA High ポリシー識別子";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA 鍵";
"06 08 60 86 48 01 65 03 02 03"			= "機能拡張";
"06 09 60 86 48 01 65 03 02 03 01"		= "鍵回復技術";
"06 09 60 86 48 01 65 03 02 03 02"		= "鍵回復対応";
"06 09 60 86 48 01 65 03 02 03 03"		= "鍵回復";
"06 08 60 86 48 01 65 03 02 04"			= "鍵修復方式";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR GAK の機能拡張";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST アルゴリズム";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell アルゴリズム";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC パッド IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC パッド IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC パッド IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC パッド";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "RSA BSAFE1-MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "RSA BSAFE1-MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "RSA BSAFE1-SHA1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM ダイジェスト";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "SHA1-RSA を使用する IKE HMAC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "MD5-RSA を使用する IKE HMAC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC パッド";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4 パケット";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA 暗号化 BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "NW パスワード";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "PKI 属性のタイプ";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "セキュリティ属性";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "信頼制限";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape オブジェクト識別子";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape 証明書の機能拡張";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Netscape 証明書のタイプ";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape ベース URL";
"06 09 60 86 48 01 86 F8 42 01 03"	= "Netscape 失効 URL";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape CA 失効 URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape CRL ダウンロード URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape CA 証明書ダウンロード URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape CA 証明書更新 URL";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape CA ポリシー URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "Netscape CA 証明書ホームページ URL";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Netscape 証明書エンティティのロゴ";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Netscape 証明書ユーザピクチャ";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscape SSL サーバ名";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape 証明書コメント";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscape データのタイプ";
"06 09 60 86 48 01 86 F8 42 02 01"	= "image/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "image/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape 証明書シーケンス";
"06 09 60 86 48 01 86 F8 42 02 06"	= "Netscape 証明書 URL";

"06 08 60 86 48 01 86 F8 42 03"			= "Netscape ディレクトリオブジェクト識別子";
"06 09 60 86 48 01 86 F8 42 03 01"		= "LDAP 定義";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "ナンバープレート";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "部署番号";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "従業員番号";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "従業員のタイプ";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "イントラネット組織担当者";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Server Gated Crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "不明な Verisign VPN の機能拡張";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "不明な Verisign VPN の機能拡張";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign ポリシー識別子";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1 通知";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "コンテンツのタイプ";
"06 04 67 2A 00 00"	= "PAN データ";
"06 04 67 2A 00 01"	= "PAN トークン";
"06 04 67 2A 00 02"	= "PAN のみ";

"06 03 67 2A 01"	= "メッセージの機能拡張";
"06 03 67 2A 02"	= "フィールド";
"06 04 67 2A 02 00"	= "フルネーム";
"06 04 67 2A 02 01"	= "名";
"06 04 67 2A 02 02"	= "姓";
"06 04 67 2A 02 03"	= "旧姓";
"06 04 67 2A 02 04"	= "地名";
"06 04 67 2A 02 05"	= "識別番号";
"06 04 67 2A 02 06"	= "月";
"06 04 67 2A 02 07"	= "日付";
"06 04 67 2A 02 08"	= "アドレス";
"06 04 67 2A 02 09"	= "電話";
"06 04 67 2A 02 0A"	= "量";
"06 04 67 2A 02 0B"	= "アカウント番号";
"06 04 67 2A 02 0C"	= "パスフレーズ";

"06 03 67 2A 03"		= "属性";
"06 04 67 2A 03 00"		= "証明書";
"06 05 67 2A 03 00 00"	= "ルート鍵拇印";
"06 05 67 2A 03 00 01"	= "追加ポリシー";

"06 03 67 2A 04"	= "アルゴリズム";
"06 03 67 2A 05"	= "ポリシー";
"06 04 67 2A 05 00"	= "ルート";
"06 03 67 2A 06"	= "モジュール";
"06 03 67 2A 07"	= "証明書の機能拡張";
"06 04 67 2A 07 00"	= "ハッシュされたルート鍵";
"06 04 67 2A 07 01"	= "証明書のタイプ";
"06 04 67 2A 07 02"	= "商用データ";
"06 04 67 2A 07 03"	= "カード証明書が必要です";
"06 04 67 2A 07 04"	= "トンネリング";
"06 04 67 2A 07 05"	= "SET の機能拡張";
"06 04 67 2A 07 06"	= "SET 修飾子";

"06 03 67 2A 08"	= "ブランド";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "製造元";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "富士通";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "日立";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "三菱";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "国別市場";
"06 05 67 2A 0A E2 00"	= "日本";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "ハッシュされたルート鍵";
"06 04 86 8D 6F 03"	= "証明書のタイプ";
"06 04 86 8D 6F 04"	= "商用データ";
"06 04 86 8D 6F 05"	= "カード証明書が必要です";
"06 04 86 8D 6F 06"	= "トンネリング";
"06 04 86 8D 6F 07"	= "SET 修飾子";
"06 04 86 8D 6F 63"	= "SET データ";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Apple データセキュリティ";

"06 08 2A 86 48 86 F7 63 64 01" = "Apple 信頼ポリシー識別子";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple iSign ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Apple X.509 基本ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Apple SSL ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Apple ローカル証明書生成ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Apple ローカル CSR 生成ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Apple CRL 失効ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Apple OCSP 失効ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Apple S/MIME ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Apple 拡張認証ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Apple ソフトウェア・アップデート署名ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple IPSec ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple iChat ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Apple リソース署名ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Apple Kerberos クライアントポリシー";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Apple Kerberos サーバポリシー";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Apple コード署名ポリシー";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Apple パッケージ署名ポリシー";

"06 08 2A 86 48 86 F7 63 64 02" = "Apple セキュリティアルゴリズム識別子";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "FEE（Fast Elliptic Encryption）";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "ASC（Apple Secure Compression）";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "MD5 署名を使用する FEE";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "SHA-1 署名を使用する FEE";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED 暗号化";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED（Experimental）";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "ECDSA 署名を使用する FEE";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac 証明書識別子";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac 証明書要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac ID 証明書要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac メール署名証明書要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac メール暗号化証明書要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac アーカイブリスト要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac アーカイブストア要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac アーカイブ取得要求";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac アーカイブ削除要求";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac 証明書拡張領域";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac ID";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac メール署名";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple .Mac メール暗号化";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple .Mac 証明書要求値";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "ユーザ名";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "パスワード";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "ホスト名";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "更新フラグ";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "非同期フラグ";

"06 08 2A 86 48 86 F7 63 64 04" = "Apple 拡張鍵用途";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Apple コード署名";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Apple コード署名（開発）";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Apple ソフトウェア・アップデート署名";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Apple コード署名（予約済み）";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple リソース署名";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple iChat 署名";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat 暗号化";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Apple システム ID";

"06 08 2A 86 48 86 F7 63 64 05" = "Apple 証明書ポリシー";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Apple 証明書ポリシー";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac 証明書ポリシー";

/* Extended key usage */

"06 04 55 1D 25 03"					= "コード署名";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel CDSA セキュリティ";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel CDSA セキュリティフォーマット";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "X.509v3 証明書拡張領域";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "X.509v3 プライベート証明書拡張領域";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "所有者の署名ビットマップ";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "所有者のピクチャ";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "所有者のメールアドレス";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "適用除外を使用";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel CDSA セキュリティアルゴリズム";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "ECDSA を使用する SHA-1";

/* end */
